SreedharanNandu/EmbeddedProjects/RadioProjects/Amul_Box_Fm/Amul_Box_Fm_Radio3/MSP430G2553_Si4703/Source/cal_const.c
/*----------------------------------------------------------------------------
 * Name:   radio.c
 *----------------------------------------------------------------------------*/

/******************************************************************************
**                  S Y S T E M     I N C L U D E S
******************************************************************************/


/******************************************************************************
**                  P R O J E C T   I N C L U D E S
******************************************************************************/

#include <stdio.h>
#include "type.h"
#include <msp430.h>
#include<msp430g2553.h>
/*****************************************************************************
*                                 Macro Definitions                          *
******************************************************************************/
#define RADIO_START_SEC_CAL_CONST
#include "memmap_radio.h"

/*****************************************************************************
*                                 Type Declarations                          *
******************************************************************************/


/*****************************************************************************
*                            Function declarations                          *
******************************************************************************/


/*****************************************************************************
*                    Globally  accessed Variable Declarations    
******************************************************************************/
#if defined(LOG_OPTION)
const char K_Vol_Text[17][7] = 
{
  {"Vol 00 "}, 
  {"Vol 01 "},
  {"Vol 02 "},	
  {"Vol 03 "},	
  {"Vol 04 "},	
  {"Vol 05 "},	
  {"Vol 06 "},	
  {"Vol 07 "},	
  {"Vol 08 "},	
  {"Vol 09 "},	
  {"Vol 10 "},
  {"Vol 11 "},
  {"Vol 12 "},
  {"Vol 13 "},
  {"Vol 14 "},
  {"Vol 15 "},
  {"Vol 16 "}
};

const char K_Ch_Text[11][5] = 
{
  {"Ch 00"}, 
  {"Ch 01"},	
  {"Ch 02"},	
  {"Ch 03"},	
  {"Ch 04"},	
  {"Ch 05"},	
  {"Ch 06"},	
  {"Ch 07"},	
  {"Ch 08"},	
  {"Ch 09"},
  {"Ch 10"}
};


const char K_Freq_Text[206][8] = 
{
  {"87.50Mhz"}, 
  {"87.60Mhz"},
  {"87.70Mhz"},
  {"87.80Mhz"},
  {"87.90Mhz"},
  {"88.00Mhz"},
  {"88.10Mhz"},
  {"88.20Mhz"},
  {"88.30Mhz"},
  {"88.40Mhz"},
  {"88.50Mhz"},
  {"88.60Mhz"},
  {"88.70Mhz"},
  {"88.80Mhz"},
  {"88.90Mhz"},
  {"89.00Mhz"},
  {"89.10Mhz"},
  {"89.20Mhz"},
  {"89.30Mhz"},
  {"89.40Mhz"},
  {"89.50Mhz"},
  {"89.60Mhz"},
  {"89.70Mhz"},
  {"89.80Mhz"},
  {"89.90Mhz"},
  {"90.00Mhz"},
  {"90.10Mhz"},
  {"90.20Mhz"},
  {"90.30Mhz"},
  {"90.40Mhz"},
  {"90.50Mhz"},
  {"90.60Mhz"},
  {"90.70Mhz"},
  {"90.80Mhz"},
  {"90.90Mhz"},
  {"91.00Mhz"},
  {"91.10Mhz"},
  {"91.20Mhz"},
  {"91.30Mhz"},
  {"91.40Mhz"},
  {"91.50Mhz"},
  {"91.60Mhz"},
  {"91.70Mhz"},
  {"91.80Mhz"},
  {"91.90Mhz"},
  {"92.00Mhz"},
  {"92.10Mhz"},
  {"92.20Mhz"},
  {"92.30Mhz"},
  {"92.40Mhz"},
  {"92.50Mhz"},
  {"92.60Mhz"},
  {"92.70Mhz"},
  {"92.80Mhz"},
  {"92.90Mhz"},
  {"93.00Mhz"},
  {"93.10Mhz"},
  {"93.20Mhz"},
  {"93.30Mhz"},
  {"93.40Mhz"},
  {"93.50Mhz"},
  {"93.60Mhz"},
  {"93.70Mhz"},
  {"93.80Mhz"},
  {"93.90Mhz"},
  {"94.00Mhz"},
  {"94.10Mhz"},
  {"94.20Mhz"},
  {"94.30Mhz"},
  {"94.40Mhz"},
  {"94.50Mhz"},
  {"94.60Mhz"},
  {"94.70Mhz"},
  {"94.80Mhz"},
  {"94.90Mhz"},
  {"95.00Mhz"},
  {"95.10Mhz"},
  {"95.20Mhz"},
  {"95.30Mhz"},
  {"95.40Mhz"},
  {"95.50Mhz"},
  {"95.60Mhz"},
  {"95.70Mhz"},
  {"95.80Mhz"},
  {"95.90Mhz"},
  {"96.00Mhz"},
  {"96.10Mhz"},
  {"96.20Mhz"},
  {"96.30Mhz"},
  {"96.40Mhz"},
  {"96.50Mhz"},
  {"96.60Mhz"},
  {"96.70Mhz"},
  {"96.80Mhz"},
  {"96.90Mhz"},
  {"97.00Mhz"},
  {"97.10Mhz"},
  {"97.20Mhz"},
  {"97.30Mhz"},
  {"97.40Mhz"},
  {"97.50Mhz"},
  {"97.60Mhz"},
  {"97.70Mhz"},
  {"97.80Mhz"},
  {"97.90Mhz"},
  {"98.00Mhz"},
  {"98.10Mhz"},
  {"98.20Mhz"},
  {"98.30Mhz"},
  {"98.40Mhz"},
  {"98.50Mhz"},
  {"98.60Mhz"},
  {"98.70Mhz"},
  {"98.80Mhz"},
  {"98.90Mhz"},
  {"99.00Mhz"},
  {"99.10Mhz"},
  {"99.20Mhz"},
  {"99.30Mhz"},
  {"99.40Mhz"},
  {"99.50Mhz"},
  {"99.60Mhz"},
  {"99.70Mhz"},
  {"99.80Mhz"},
  {"99.90Mhz"},
  {"100.0Mhz"},
  {"100.1Mhz"},
  {"100.2Mhz"},
  {"100.3Mhz"},
  {"100.4Mhz"},
  {"100.5Mhz"},
  {"100.6Mhz"},
  {"100.7Mhz"},
  {"100.8Mhz"},
  {"100.9Mhz"},
  {"101.0Mhz"},
  {"101.1Mhz"},
  {"101.2Mhz"},
  {"101.3Mhz"},
  {"101.4Mhz"},
  {"101.5Mhz"},
  {"101.6Mhz"},
  {"101.7Mhz"},
  {"101.8Mhz"},
  {"101.9Mhz"},
  {"102.0Mhz"},
  {"102.1Mhz"},
  {"102.2Mhz"},
  {"102.3Mhz"},
  {"102.4Mhz"},
  {"102.5Mhz"},
  {"102.6Mhz"},
  {"102.7Mhz"},
  {"102.8Mhz"},
  {"102.9Mhz"},
  {"103.0Mhz"},
  {"103.1Mhz"},
  {"103.2Mhz"},
  {"103.3Mhz"},
  {"103.4Mhz"},
  {"103.5Mhz"},
  {"103.6Mhz"},
  {"103.7Mhz"},
  {"103.8Mhz"},
  {"103.9Mhz"},
  {"104.0Mhz"},
  {"104.1Mhz"},
  {"104.2Mhz"},
  {"104.3Mhz"},
  {"104.4Mhz"},
  {"104.5Mhz"},
  {"104.6Mhz"},
  {"104.7Mhz"},
  {"104.8Mhz"},
  {"104.9Mhz"},
  {"105.0Mhz"},
  {"105.1Mhz"},
  {"105.2Mhz"},
  {"105.3Mhz"},
  {"105.4Mhz"},
  {"105.5Mhz"},
  {"105.6Mhz"},
  {"105.7Mhz"},
  {"105.8Mhz"},
  {"105.9Mhz"},
  {"106.0Mhz"},
  {"106.1Mhz"},
  {"106.2Mhz"},
  {"106.3Mhz"},
  {"106.4Mhz"},
  {"106.5Mhz"},
  {"106.6Mhz"},
  {"106.7Mhz"},
  {"106.8Mhz"},
  {"106.9Mhz"},
  {"107.0Mhz"},
  {"107.1Mhz"},
  {"107.2Mhz"},
  {"107.3Mhz"},
  {"107.4Mhz"},
  {"107.5Mhz"},
  {"107.6Mhz"},
  {"107.7Mhz"},
  {"107.8Mhz"},
  {"107.9Mhz"},
  {"108.0Mhz"}
};
#endif

const char K_Welcome_Text[23] = {"Sree's FM Radio Project"};
const char K_PwrON_Text[8] = {"Power ON"}; 
const char K_PwrOFF_Text[9] = {"Power OFF"};
const char K_Mute_Text[5] = {"Mute "}; 
const char K_VolSelON_Text[10] = {"Vol Sel ON"}; 
const char K_VolSelOFF_Text[11] = {"Vol Sel OFF"};  
const char K_Saved_Text[5] = {"Saved"};
const char K_Preset_Text[11] = {"Preset Mode"};
const char K_Manual_Text[11] = {"Manual Mode"};

// Create some test blink requests (num_id , num_blinks, on_time, off_time)
const BlinkRequest_T K_blink_ModeChange = {BLINK_MODE_CHANGE  , 1u,   100u/SAMPLE_PER,  250u/SAMPLE_PER}; // blinks, on and off
const BlinkRequest_T K_blink_Store =      {STORE              , 1u,  2000u/SAMPLE_PER,  100u/SAMPLE_PER}; // blinks, on and off
const BlinkRequest_T K_blink_PwnOnOff =   {PWNONOFF           , 5u,   250u/SAMPLE_PER,  250u/SAMPLE_PER}; // blinks, on and off
const BlinkRequest_T K_blink_RotChange =  {ROTCHANGE          , 1u,   20u/SAMPLE_PER,   20u/SAMPLE_PER}; // blinks, on and off

const unsigned char K_Power_Led_Delay = 250u;
const unsigned int K_Uart_Baud = 9600u;

const unsigned int K_Fm_Max_Freq = 10800u;
const unsigned int K_Fm_Min_Freq = 8750u;

const unsigned char K_Default_Si_Vol_Level = 1u;
const unsigned char K_Min_Si_Vol_Level = 0u;
const unsigned char K_Max_Si_Vol_Level = 15u;

const unsigned char K_Amp_Mute_Timer = 7u;

#define RADIO_STOP_SEC_CAL_CONST
#include "memmap_radio.h"

